# CategoryNameMap Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategoryNameMap Constructor
CategoryNameMap Class See Also
---
Initializes a new instance of the CategoryNameMap class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CategoryNameMap()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CategoryNameMap()
```

# See Also
CategoryNameMap Class
Autodesk.Revit.DB Namespace